#Использовать "../src"
#Использовать asserts
#Использовать moskito
#Использовать logos

Перем МониторАппаратныхКлючей;
Перем ИсполнительКоманд;

Процедура ПередЗапускомТеста() Экспорт
	
	Лог = Логирование.ПолучитьЛог("oscript.lib.v8haspmonitor");

	Если МониторАппаратныхКлючей = Неопределено Тогда
		МониторАппаратныхКлючей = Новый МониторАппаратныхКлючей;
	КонецЕсли;

	Если ИсполнительКоманд = Неопределено Тогда
		ИсполнительКоманд = Мок.Получить(Новый ИсполнительКоманд);
	КонецЕсли;

	МониторАппаратныхКлючей.УстановитьИсполнительКоманд(ИсполнительКоманд);
	
КонецПроцедуры // ПередЗапускомТеста()

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПолучитьСписокМенеджеровЛицензий");	

	Возврат ВсеТесты;

КонецФункции

Процедура ТестДолжен_ПолучитьСписокМенеджеровЛицензий() Экспорт

	МониторАппаратныхКлючей = Новый МониторАппаратныхКлючей;

	ТаблицаМенеджеровЛицензий = МониторАппаратныхКлючей.СписокМенеджеровЛицензий();

	Утверждения.ПроверитьБольше(ТаблицаМенеджеровЛицензий.Количество(), 0, 
		"Не удалось получить список менеджеров лицензий");

КонецПроцедуры
