#Использовать "../src"
#Использовать asserts

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПолучитьСписокМенеджеровЛицензий");	

	Возврат ВсеТесты;
КонецФункции

Процедура ТестДолжен_ПолучитьСписокМенеджеровЛицензий() Экспорт

    МониторАппаратныхКлючей = Новый МониторАппаратныхКлючей;
    МониторАппаратныхКлючей.УстановитьПутьКФайлуНастроек(ПутьКФайлуНастроек);

	ТаблицаМенеджеровЛицензий = МониторАппаратныхКлючей.СписокМенеджеровЛицензий();

	Утверждения.ПроверитьБольше(ТаблицаМенеджеровЛицензий.Количество(), 0, "Не удалось получить список менеджеров лицензий");

КонецПроцедуры
