#Использовать "../src"
#Использовать "./fixtures"
#Использовать asserts
#Использовать moskito
#Использовать logos

Перем МониторАппаратныхКлючей;
Перем ИсполнительКоманд;

Процедура ПередЗапускомТеста() Экспорт

    Лог = Служебный.Лог();
    Лог.УстановитьУровень(УровниЛога.Отладка);

    Если МониторАппаратныхКлючей = Неопределено Тогда
        МониторАппаратныхКлючей = Новый МониторАппаратныхКлючей;
    КонецЕсли;

    Если ИсполнительКоманд = Неопределено Тогда
        ИсполнительКоманд = Мок.Получить(Новый ИсполнительКоманд);
    КонецЕсли;

    МониторАппаратныхКлючей.УстановитьИсполнительКоманд(ИсполнительКоманд);

КонецПроцедуры // ПередЗапускомТеста()

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    
    ВсеТесты = Новый Массив;
    
    ВсеТесты.Добавить("ТестДолжен_ПолучитьСписокМенеджеровЛицензий");	
    ВсеТесты.Добавить("ТестДолжен_ПолучитьСписокМодулейМенеджеровЛицензий");	
    ВсеТесты.Добавить("ТестДолжен_ПолучитьСписокПодключений");	

    Возврат ВсеТесты;

КонецФункции

Процедура ТестДолжен_ПолучитьСписокМенеджеровЛицензий() Экспорт

    ПараметрыТестирования.УстановитьВыводИсполнителяКоманд(МониторАппаратныхКлючей.ИсполнительКоманд(), "МенеджерыЛицензий.Список");

    МенеджерыЛицензий = МониторАппаратныхКлючей.СписокМенеджеровЛицензий();

    Утверждения.ПроверитьБольше(МенеджерыЛицензий.Количество(), 0, 
        "Не удалось получить список менеджеров лицензий");

КонецПроцедуры

Процедура ТестДолжен_ПолучитьСписокМодулейМенеджеровЛицензий() Экспорт

    ПараметрыТестирования.УстановитьВыводИсполнителяКоманд(МониторАппаратныхКлючей.ИсполнительКоманд(), "Модули.Список");

    ИдентификаторМенеджера = ПараметрыТестирования.Параметры().ИдентификаторМенеджера;
    Модули = МониторАппаратныхКлючей.СписокМодулейМенеджераЛицензий(ИдентификаторМенеджера);

    Утверждения.ПроверитьБольше(Модули.Количество(), 0, 
        "Не удалось получить список модулей менеджера лицензий");

КонецПроцедуры

Процедура ТестДолжен_ПолучитьСписокПодключений() Экспорт

    ПараметрыТестирования.УстановитьВыводИсполнителяКоманд(МониторАппаратныхКлючей.ИсполнительКоманд(), "Подключения.Список");

    ИдентификаторМенеджера = ПараметрыТестирования.Параметры().ИдентификаторМенеджера;
    ПараметрыКлюча = Новый Структура("ИдентификаторМенеджера, АдресМодуля", ИдентификаторМенеджера, "1");
    Подключения = МониторАппаратныхКлючей.СписокПодключений(ПараметрыКлюча);

    Утверждения.ПроверитьБольше(Подключения.Количество(), 0, 
        "Не удалось получить список подключений к ключу");

КонецПроцедуры

ПередЗапускомТеста();
